tylertms/dspic33e-sim/conformance/processor.c
    reset_processor_conformance(cpu, 0x200u);
    load_instruction(state, cpu, 0x200u, OPCODE_MOV_W2_W2);
    load_instruction(state, cpu, 0x202u, OPCODE_MOV_W2_INDIRECT_W3);
    dspic33_set_working_register(cpu, 2u, 0x1000u);
    dspic33_write_word(cpu, 0x1000u, 0x1234u);
    expect_step_cycles(state, cpu, 1u, "same-value direct write uses one cycle");
    expect_step_cycles(state, cpu, 2u,
                       "same-value direct write still creates dependency");
    expect(state, cpu->w[3] == 0x1234u, "same-value dependency preserves source value");

    reset_processor_conformance(cpu, 0x200u);
    load_instruction(state, cpu, 0x200u, OPCODE_MOV_LITERAL_0X1000_W2);
    load_instruction(state, cpu, 0x202u, OPCODE_NOP);
    load_instruction(state, cpu, 0x204u, OPCODE_MOV_W2_INDIRECT_W3);
    dspic33_write_word(cpu, 0x1000u, 0x2345u);
    expect_step_cycles(state, cpu, 1u,
                       "intervening-control pointer setup uses one cycle");
    expect_step_cycles(state, cpu, 1u,
                       "intervening instruction consumes dependency window");
    expect_step_cycles(state, cpu, 1u,
                       "source after intervening instruction does not stall");
    expect(state, cpu->w[3] == 0x2345u, "intervening instruction control reads value");

    reset_processor_conformance(cpu, 0x200u);
    load_instruction(state, cpu, 0x200u, OPCODE_MOV_W3_W2_INDIRECT);
    load_instruction(state, cpu, 0x202u, OPCODE_MOV_W2_INDIRECT_W4);
    dspic33_set_working_register(cpu, 2u, 0x1000u);
    dspic33_set_working_register(cpu, 3u, 0xa55au);
    expect_step_cycles(state, cpu, 1u, "indirect destination preserves pointer timing");
    expect_step_cycles(state, cpu, 1u,
                       "unmodified indirect destination does not create dependency");
    expect(state, cpu->w[4] == 0xa55au, "unmodified pointer reads stored value");

    reset_processor_conformance(cpu, 0x200u);
    load_instruction(state, cpu, 0x200u, OPCODE_MOV_W3_W2_POST_INCREMENT);
    load_instruction(state, cpu, 0x202u, OPCODE_MOV_W2_INDIRECT_W4);
    dspic33_set_working_register(cpu, 2u, 0x1000u);
    dspic33_set_working_register(cpu, 3u, 0x1111u);
    dspic33_write_word(cpu, 0x1002u, 0x2222u);
    expect_step_cycles(state, cpu, 1u, "destination postincrement uses one cycle");
    expect_step_cycles(state, cpu, 2u,
                       "destination postincrement creates pointer dependency");
    expect(state, cpu->w[2] == 0x1002u && cpu->w[4] == 0x2222u,
           "destination dependency uses updated pointer");

    reset_processor_conformance(cpu, 0x200u);
    load_instruction(state, cpu, 0x200u, OPCODE_MOV_W2_POST_INCREMENT_W3);
    load_instruction(state, cpu, 0x202u, OPCODE_MOV_W2_INDIRECT_W4);
    dspic33_set_working_register(cpu, 2u, 0x1000u);
    dspic33_write_word(cpu, 0x1000u, 0x3333u);
    dspic33_write_word(cpu, 0x1002u, 0x4444u);
    expect_step_cycles(state, cpu, 1u, "source postincrement uses one cycle");
    expect_step_cycles(state, cpu, 2u,
                       "source postincrement creates pointer dependency");
    expect(state, cpu->w[3] == 0x3333u && cpu->w[4] == 0x4444u,
           "source dependency preserves both reads");

    reset_processor_conformance(cpu, 0x200u);
    load_instruction(state, cpu, 0x200u, OPCODE_MOV_LITERAL_0X1000_W2);
    load_instruction(state, cpu, 0x202u, OPCODE_MOV_W3_W2_INDIRECT);
    dspic33_set_working_register(cpu, 3u, 0x5a5au);
    expect_step_cycles(state, cpu, 1u, "destination pointer setup uses one cycle");
    expect_step_cycles(state, cpu, 1u,
                       "destination address calculation does not create source stall");
    expect(state, dspic33_read_word(cpu, 0x1000u) == 0x5a5au,
           "destination-only dependency control stores value");

    reset_processor_conformance(cpu, 0x200u);
    load_instruction(state, cpu, 0x200u, OPCODE_MOV_LITERAL_0X1000_W2);
    load_instruction(state, cpu, 0x202u, OPCODE_MOV_W2_W4_OFFSET_W3);
    dspic33_set_working_register(cpu, 4u, 2u);
    dspic33_write_word(cpu, 0x1002u, 0x6789u);
    expect_step_cycles(state, cpu, 1u, "indexed base setup uses one cycle");
    expect_step_cycles(state, cpu, 2u, "indexed source depends on base register");
    expect(state, cpu->w[3] == 0x6789u, "indexed base dependency reads value");

    reset_processor_conformance(cpu, 0x200u);
    load_instruction(state, cpu, 0x200u, OPCODE_MOV_LITERAL_2_W4);
    load_instruction(state, cpu, 0x202u, OPCODE_MOV_W2_W4_OFFSET_W3);
    dspic33_set_working_register(cpu, 2u, 0x1000u);
    dspic33_write_word(cpu, 0x1002u, 0x789au);
    expect_step_cycles(state, cpu, 1u, "indexed offset setup uses one cycle");
    expect_step_cycles(state, cpu, 2u, "indexed source depends on offset register");
    expect(state, cpu->w[3] == 0x789au, "indexed offset dependency reads value");

    reset_processor_conformance(cpu, 0x200u);
    load_instruction(state, cpu, 0x200u, OPCODE_MOV_LITERAL_0X1000_W2);
    load_instruction(state, cpu, 0x202u, OPCODE_TBLRDL_W2_W3);
    expect(state, dspic33_load_program_word(cpu, 0x1000u, 0x00abcdefu),
           "load table dependency value");
    expect_step_cycles(state, cpu, 1u, "table pointer setup uses one cycle");
    expect_step_cycles(state, cpu, 6u, "table read source pointer dependency stalls");
    expect(state, cpu->w[3] == 0xcdefu, "table dependency preserves read value");

    reset_processor_conformance(cpu, 0x200u);
    load_instruction(state, cpu, 0x200u, OPCODE_MOV_LITERAL_0X8100_W2);
    load_instruction(state, cpu, 0x202u, OPCODE_MOV_W2_INDIRECT_W3);
    expect(state, dspic33_load_program_word(cpu, 0x0100u, 0x00123456u),
           "load PSV dependency value");
    cpu->dsrpag = 0x0200u;
    expect_step_cycles(state, cpu, 1u, "PSV pointer setup uses one cycle");
    expect_step_cycles(state, cpu, 6u, "PSV access composes with dependency stall");
    expect(state, cpu->w[3] == 0x3456u, "PSV dependency preserves read value");

    reset_processor_conformance(cpu, 0x200u);
    load_instruction(state, cpu, 0x200u, OPCODE_MOV_LITERAL_0X1000_W8);
    load_instruction(state, cpu, 0x202u, OPCODE_DSP_X_NO_UPDATE_Y_W10_DECREMENT);
    dspic33_set_working_register(cpu, 4u, 3u);
    dspic33_set_working_register(cpu, 5u, 4u);
    dspic33_set_working_register(cpu, 10u, 0x9002u);
    dspic33_write_word(cpu, 0x1000u, 0x1357u);
    dspic33_write_word(cpu, 0x9002u, 0x2468u);
    cpu->corcon = 0x0021u;
    expect_step_cycles(state, cpu, 1u, "DSP source pointer setup uses one cycle");
    expect_step_cycles(state, cpu, 2u, "DSP prefetch source dependency stalls");
    expect(state, cpu->w[4] == 0x1357u && cpu->w[5] == 0x2468u,
           "DSP dependency preserves both prefetches");

