tylertms/dspic33e-sim/conformance/processor.c
    prepare_invalid_dsp_matrix_case(cpu);
    dspic33_set_working_register(cpu, 15u, 0x5000u);
    illegal_resets = cpu->illegal_reset_count;
    matches = dspic33_load_program_word(cpu, 0u, opcode) &&
              dspic33_step(cpu) == DSPIC33_RUNNING && cpu->illegal_reset &&
              cpu->illegal_reset_count == illegal_resets + 1u &&
              cpu->software_reset_count == 0u && cpu->trap_count == 0u &&
              cpu->last_trap == UINT16_MAX && cpu->pc == 0u && cpu->w[15] == 0x1000u &&
              cpu->initialized_working_registers == 0x8000u &&
              (dspic33_read_word(cpu, 0x0740u) & 0x4000u) != 0u &&
              dspic33_read_word(cpu, 0x5000u) == 0xa5a5u;
    for (reg = 0u; reg < 15u; reg++) {
        matches = matches && cpu->w[reg] == 0u;
    }
    expect_dsp_matrix_case(state, matches, opcode, "illegal move encoding");
}

static void move_literal_encoding_matrix_cases(ProcessorConformance* state,
                                               Dspic33* cpu) {
    uint32_t cases = 0u;
    uint32_t literal;
    uint8_t destination;

    dspic33_reset(cpu, 0u);
    dspic33_set_async_events(cpu, false);
    for (literal = 0u; literal <= UINT16_MAX; literal++) {
        for (destination = 0u; destination < 16u; destination++) {
            uint32_t opcode = 0x200000u | (literal << 4u) | (uint32_t)destination;
            uint16_t expected =
                destination == 15u ? (uint16_t)(literal & 0xfffeu) : (uint16_t)literal;
            uint64_t cycles;
            bool matches;

            prepare_move_matrix_case(cpu);
            dspic33_set_working_register(cpu, destination, 0x5a5au);
            cycles = cpu->cycles;
            matches = dspic33_load_program_word(cpu, 0u, opcode) &&
                      dspic33_step(cpu) == DSPIC33_RUNNING && cpu->pc == 2u &&
                      cpu->cycles - cycles == 1u && cpu->w[destination] == expected &&
                      cpu->sr == 0x010fu && cpu->unsupported_opcode == 0u &&
                      !cpu->illegal_reset && cpu->last_trap == UINT16_MAX;
            expect_dsp_matrix_case(state, matches, opcode, "MOV literal encoding");
            cases++;
        }
    }
    expect(state, cases == 1048576u, "MOV literal encoding matrix is exhaustive");

    cases = 0u;
    for (literal = 0u; literal <= UINT8_MAX; literal++) {
        for (destination = 0u; destination < 16u; destination++) {
            uint32_t opcode = 0xb3c000u | (literal << 4u) | (uint32_t)destination;
            uint16_t expected = (uint16_t)(0x5a00u | literal);
            uint64_t cycles;
            bool matches;
            if (destination == 15u) {
                expected &= 0xfffeu;
            }
            prepare_move_matrix_case(cpu);
            dspic33_set_working_register(cpu, destination, 0x5a5au);
            cycles = cpu->cycles;
            matches = dspic33_load_program_word(cpu, 0u, opcode) &&
                      dspic33_step(cpu) == DSPIC33_RUNNING && cpu->pc == 2u &&
                      cpu->cycles - cycles == 1u && cpu->w[destination] == expected &&
                      cpu->sr == 0x010fu && cpu->unsupported_opcode == 0u &&
                      !cpu->illegal_reset && cpu->last_trap == UINT16_MAX;
            expect_dsp_matrix_case(state, matches, opcode, "MOV byte literal encoding");
            cases++;
        }
    }
    expect(state, cases == 4096u, "MOV byte literal encoding matrix is exhaustive");
}

static void move_register_encoding_matrix_cases(ProcessorConformance* state,
                                                Dspic33* cpu) {
    uint32_t cases = 0u;
    uint32_t opcode;

    dspic33_reset(cpu, 0u);
    dspic33_set_async_events(cpu, false);
    for (opcode = 0xfd0000u; opcode <= 0xfd0fffu; opcode++) {
        bool legal = (opcode & 0xfff870u) == 0xfd0000u;
        if (!legal) {
            run_invalid_move_matrix_case(state, cpu, opcode);
        } else {
            uint8_t source = (uint8_t)(opcode & 0x0fu);
            uint8_t destination = (uint8_t)((opcode >> 7u) & 0x0fu);
            uint16_t source_value = (uint16_t)(0x1100u | source);
            uint16_t destination_value = (uint16_t)(0x2200u | destination);
            uint16_t expected_source;
            uint16_t expected_destination;
            uint64_t cycles;
            bool matches;

            prepare_move_matrix_case(cpu);
            dspic33_set_working_register(cpu, source, source_value);
            dspic33_set_working_register(cpu, destination, destination_value);
            if (source == destination) {
                dspic33_set_working_register(cpu, source, source_value);
            }
            expected_destination = cpu->w[source];
            expected_source = cpu->w[destination];
            if (source == 15u) {
                expected_source &= 0xfffeu;
            }
            if (destination == 15u) {
                expected_destination &= 0xfffeu;
            }
            cycles = cpu->cycles;
            matches = dspic33_load_program_word(cpu, 0u, opcode) &&
                      dspic33_step(cpu) == DSPIC33_RUNNING && cpu->pc == 2u &&
                      cpu->cycles - cycles == 1u && cpu->w[source] == expected_source &&
                      cpu->w[destination] == expected_destination &&
                      cpu->sr == 0x010fu && cpu->unsupported_opcode == 0u &&
                      !cpu->illegal_reset;
            expect_dsp_matrix_case(state, matches, opcode, "EXCH encoding");
        }
        cases++;
    }
    expect(state, cases == 4096u, "EXCH encoding matrix is exhaustive");

    cases = 0u;
    for (opcode = 0xfd8000u; opcode <= 0xfdffffu; opcode++) {
        bool legal = (opcode & 0xffbff0u) == 0xfd8000u;
        if (!legal) {
            run_invalid_move_matrix_case(state, cpu, opcode);
        } else {
            uint8_t reg = (uint8_t)(opcode & 0x0fu);
            bool byte_mode = (opcode & 0x004000u) != 0u;
            uint16_t expected = byte_mode ? 0xa5a5u : 0x5aa5u;
            uint64_t cycles;
            bool matches;
            if (reg == 15u) {
                expected &= 0xfffeu;
            }
            prepare_move_matrix_case(cpu);
            dspic33_set_working_register(cpu, reg, 0xa55au);
            cycles = cpu->cycles;
            matches = dspic33_load_program_word(cpu, 0u, opcode) &&
                      dspic33_step(cpu) == DSPIC33_RUNNING && cpu->pc == 2u &&
                      cpu->cycles - cycles == 1u && cpu->w[reg] == expected &&
                      cpu->sr == 0x010fu && cpu->unsupported_opcode == 0u &&
                      !cpu->illegal_reset;
            expect_dsp_matrix_case(state, matches, opcode, "SWAP encoding");
        }
        cases++;
    }
    expect(state, cases == 32768u, "SWAP encoding matrix is exhaustive");
}

static void movpag_encoding_matrix_cases(ProcessorConformance* state, Dspic33* cpu) {
    uint32_t cases = 0u;
    uint32_t opcode;

    dspic33_reset(cpu, 0u);
    dspic33_set_async_events(cpu, false);
    for (opcode = 0xfec000u; opcode <= 0xfecfffu; opcode++) {
        uint8_t page_register = (uint8_t)((opcode >> 10u) & 3u);
        uint16_t literal = (uint16_t)(opcode & 0x03ffu);
        if (page_register == 3u) {
            run_invalid_move_matrix_case(state, cpu, opcode);
        } else {
            uint16_t expected = page_register == 0u   ? literal
                                : page_register == 1u ? (uint16_t)(literal & 0x01ffu)
                                                      : (uint16_t)(literal & 0x00ffu);
            uint64_t cycles;
            bool matches;
            prepare_move_matrix_case(cpu);
            cpu->dsrpag = 0x0155u;
            cpu->dswpag = 0x00aau;
            cpu->tblpag = 0x005au;
            cycles = cpu->cycles;
            matches = dspic33_load_program_word(cpu, 0u, opcode) &&
                      dspic33_step(cpu) == DSPIC33_RUNNING && cpu->pc == 2u &&
                      cpu->cycles - cycles == 1u && cpu->unsupported_opcode == 0u &&
                      !cpu->illegal_reset;
            if (page_register == 0u) {
                matches = matches && cpu->dsrpag == expected;
            } else if (page_register == 1u) {
                matches = matches && cpu->dswpag == expected;
            } else {
                matches = matches && cpu->tblpag == expected;
            }
            expect_dsp_matrix_case(state, matches, opcode, "MOVPAG literal encoding");
        }
        cases++;
    }
    expect(state, cases == 4096u, "MOVPAG literal encoding matrix is exhaustive");

    cases = 0u;
    for (opcode = 0xfed000u; opcode <= 0xfedfffu; opcode++) {
        bool fields_valid = (opcode & 0x0003f0u) == 0u;
        uint8_t page_register = (uint8_t)((opcode >> 10u) & 3u);
        if (!fields_valid || page_register == 3u) {
            run_invalid_move_matrix_case(state, cpu, opcode);
        } else {
            uint8_t source = (uint8_t)(opcode & 0x0fu);
            uint16_t value = (uint16_t)(0x03a0u | source);
            uint16_t expected;
            uint64_t cycles;
            bool matches;
            prepare_move_matrix_case(cpu);
            dspic33_set_working_register(cpu, source, value);
            value = cpu->w[source];
            expected = page_register == 0u   ? (uint16_t)(value & 0x03ffu)
                       : page_register == 1u ? (uint16_t)(value & 0x01ffu)
                                             : (uint16_t)(value & 0x00ffu);
            cpu->dsrpag = 0x0155u;
            cpu->dswpag = 0x00aau;
            cpu->tblpag = 0x005au;
            cycles = cpu->cycles;
            matches = dspic33_load_program_word(cpu, 0u, opcode) &&
                      dspic33_step(cpu) == DSPIC33_RUNNING && cpu->pc == 2u &&
                      cpu->cycles - cycles == 1u && cpu->unsupported_opcode == 0u &&
                      !cpu->illegal_reset;
            if (page_register == 0u) {
                matches = matches && cpu->dsrpag == expected;
            } else if (page_register == 1u) {
                matches = matches && cpu->dswpag == expected;
            } else {
                matches = matches && cpu->tblpag == expected;
            }
            expect_dsp_matrix_case(state, matches, opcode, "MOVPAG register encoding");
        }
        cases++;
    }
    expect(state, cases == 4096u, "MOVPAG register encoding matrix is exhaustive");
}

